app/Http/Controllers/DeliveryController.php

select `deliveries`.`id` as `delivery_id`, `products`.`id` as `product_id`, `products`.`name` as `product_name`, `products`.`price`, `items`.`quantity`, price * quantity as total from `deliveries` inner join `users` as `u` on `u`.`id` = `deliveries`.`customer_id` inner join `users` as `u2` on `u2`.`id` = `deliveries`.`store_id` inner join `items` on `items`.`delivery_id` = `deliveries`.`id` inner join `products` on `products`.`id` = `items`.`product_id` where `store_id` = 1
---
    public function index()
    {
        $delivery = DB::table('deliveries')
        ->select('deliveries.id as delivery_id','u.name as store_name', 'u2.name as customer_name',
         'deliveries.payment', 'deliveries.status')
        ->join('users as u', 'u.id', '=', 'deliveries.store_id')
        ->join('users as u2', 'u2.id', '=', 'deliveries.customer_id')
        ->where('u.id', '=', Auth::user()->id)
        ->get();

        $items = DB::table('deliveries')
        ->select('deliveries.id as delivery_id', 'items.id as item_id', 'products.name as name_product')
        ->join('users as u', 'u.id', '=', 'deliveries.store_id')
        ->join('users as u2', 'u2.id', '=', 'deliveries.customer_id')
        ->join('items', 'items.delivery_id', '=', 'deliveries.id')
        ->join('products', 'products.id', '=', 'items.product_id')
        ->where('u.id', '=', Auth::user()->id)
        ->get();